// Определить количество цифр в числе

System.Console.WriteLine("Введите число ");
string s;
int count=0;
s= Console.ReadLine();
count = s.Length;


System.Console.WriteLine("Количество цифр в числе: "+ count);