//Даны два числа. Показать большее и меньшее число

int a = 7;
int b = 5;

if (a>b) Console.WriteLine("a больше b");
if (a<b) Console.WriteLine("a меньше b");
if (a==b) Console.WriteLine("a равно b");
